# coding=utf-8


CUIT_COLLEGE = {
   '0': u"软件工程学院",
   '1': u"计算机学院",
   '2': u"信息安全工程学院",
   '3': u"电子工程学院",
   '4': u"通信工程学院",
   '5': u"应用数学学院",
   '6': u"资源环境学院",
   '7': u"光电技术学院",
   '8': u"控制工程学院",
   '9': u"大气科学学院",
   '10':u"外国语学院",
   '11':u"管理学院",
   '12':u"政治学院",
   '13':u"文化艺术学院",
   '14':u"统计学院",
   '15':u"商学院",
   '16':u"物流学院" ,
}


SCHOOL = {
    'cuit': {
        'name': u'成都信息工程大学',
        'college': CUIT_COLLEGE
    }
}


HONOR_LEVEL = {
    0: u'区域赛金奖',
    1: u'区域赛银奖',
    2: u'区域赛铜奖',
    3: u'区域赛优胜奖',
    4: u'省赛一等奖',
    5: u'省赛二等奖',
    6: u'省赛三等奖',
    7: u'省赛优胜奖',
    8: u'校赛特等奖',
    9: u'校赛一等奖',
    10: u'校赛二等奖',
    11: u'校赛三等奖',
}


OJ_MAP = {
    'hdu': 'HDU',
    'cf': 'Codeforces',
    'bc': 'BestCoder',
    'poj': 'POJ',
    'zoj': 'ZOJ',
    'bnu': 'BNU',
    'vj': 'Virtual Judge',
}
